cases/kwsstTransient/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// density of air
rho         [1 -3 0 0 0 0 0]    1.225;

// kinematic viscosity of air
nu          [0 2 -1 0 0 0 0]    1.568E-5;

// relative permitivity
eps         [0 0 0 0 0 0 0]     1;

// Debye length
lambda      [0 1 0 0 0 0 0]     1.0E-3;

// amplitude of electric potential input
// (dimension [V] has already been hard coded)
elPotMax    [0 0 0 0 0 0 0]     5.0e3; // 5.0e3 Suzen reference

// amplitude of charge density input 
// (dimension [C / m^3] has already been hard coded)
rhoCMax     [0 0 0 0 0 0 0]     0.0008; // 0.0008 5.0e3 Suzen reference


// frequency of input sine signal 
omega       [0 0 -1 0 0 0 0]    4.5E3;

// ************************************************************************* //
