cases/kwsstTransient/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0]; // [m/s]

internalField   uniform (1.0E-3 0 0);

boundaryField
{
    exposed        
    {    
        type            noSlip;
    }
    solidWall      
    {   
        type            noSlip;
    }
    
    wallRhoC      
    {   
        type            noSlip;
    }

    front     
    {
        type            empty; 
    }
   
    back 
    {
        type            empty;      
    }

    top
    {
        type            slip;
    }
    
    bottom
    {
        type            noSlip;
    }
    
    inlet
    {
        type            fixedValue;
        value           uniform (1.0E-1 0 0);
    }
    
    outlet
    {
        type            zeroGradient; 
    }

}


// ************************************************************************* //
