cases/kwsstTransient/0.org/ElPot
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          ElPot;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 2 -3 0 0 -1 0]; // [kg * m^2 /( s^3 A)]

internalField   uniform 0;

boundaryField
{
    exposed        
    {    
        type            fixedValue;
        value           uniform 1; 
    }
    
    solidWall      
    {   
        type            zeroGradient; 
    }
    
    wallRhoC      
    {   
        type            zeroGradient; 
    }

    front     
    {
        type            empty;  
    }
   
    back 
    {
        type            empty;      
    }

    top
    {
        type            zeroGradient; 
    }
    
    bottom
    {
        type            zeroGradient; 
    }
    
    inlet
    {
        type            zeroGradient; 
    }
    
    outlet
    {
        type            zeroGradient; 
    }

}


// ************************************************************************* //
