cases/kwsstTransient/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 30.618;

boundaryField
{
	exposed        
    {    
		type            omegaWallFunction;
        value           $internalField;
	}
	solidWall      
    {   
		type            omegaWallFunction;
        value           $internalField;
    }
	
	wallRhoC      
    {   
		type            omegaWallFunction;
        value           $internalField;
    }

    front     
    {
		type            empty; 
    }
   
	back 
	{
		type            empty;  	
	}

	top
	{
		type            zeroGradient; 
    }
	
	bottom
	{
		type            omegaWallFunction;
        value           $internalField;
    }
	
	inlet
	{
		type            fixedValue;
        value           $internalField;
    }
	
	outlet
	{
		type            zeroGradient; 
    }
}

// ************************************************************************* //