cases/kwsstTransient/0.org/rhoC
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          rhoC;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 -3 1 0 0 1 0]; // [A * S /( m^3)]

internalField   uniform 0;

boundaryField
{
    exposed        
    {   
        type            zeroGradient; 
    }

    solidWall      
    {   
        type            zeroGradient;  
    }
    
    wallRhoC      
    {   
        type            codedFixedValue;
        value           $internalField;
        
        name    rhoCDistribution;
        code
        #{
            
            const vectorField& Cf = patch().Cf();
            scalarField& field = *this;
            
            const scalar sigma = 0.5;
            const scalar mu = 0.005;
            
            forAll(Cf, faceI)
            {
                const scalar x = Cf[faceI][0];
                //const scalar z = Cf[faceI][2];
                
                field[faceI] = exp(-pow(((x)/mu),2)/(2*pow(sigma,2)));
                //Gx4 = np.exp( -((x-0.005)/0.005)**2 / (2 * 0.5**2) )
            }
        #};
                
    }
    
    front     
    {
        type            empty; 
    }
   
    back 
    {
        type            empty;      
    }

    top
    {
        type            zeroGradient; 
    }
    
    bottom
    {
        type            zeroGradient; 
    }
    
    inlet
    {
        type            zeroGradient; 
    }
    
    outlet
    {
        type            zeroGradient; 
    }

}


// ************************************************************************* //
